const questions: Question[] = [
	{
		id: '0',
		name: 'Отец Линукса',
		description: 'Как звал человека создавшего ядро Linux?',
		answer: 'Линус Торвальдс',
	},
	{
		id: '1',
		name: 'Что там по байтам?',
		description: 'Сколько бит информации выделяется на кодировку одного символа в кодировке UTF-8?',
		answer: 'На кодирование одного символа выделяется 8 бит',
	},
	{
		id: '2',
		name: 'Из грязи в князя',
		description: 'Какой язык был основан в 1991 году, но лишь в последние 5 лет получил всемирное распространение?',
		answer: 'Python',
	},
	{
		id: '3',
		name: 'Это база',
		description: 'Эта игра превзошла по продажам Тетрис и на данный момент остаётся популярной?',
		answer: 'Minecraft',
	},
	{
		id: '4',
		name: 'Типа кто?',
		description: 'Какой тип используется в С# для определения ',
		answer: 'test',
	},
	{
		id: '5',
		name: 'Это нужно отложить?',
		description: 'Что такое отладка?',
		answer: 'Отладка – это процесс поиска и устранения ошибок в программе',
	},
	{
		id: '6',
		name: 'test',
		description: 'Для чего нужны циклы?',
		answer: 'Циклы определяют участок программы для многократного повторения и количество этих повторений',
	},
	{
		id: '7',
		name: 'Стабильность наше всё',
		description: 'Как работает константа?',
		answer: 'Константа – постоянная, именованное значение, которое не может быть изменено. Константы могут быть числовыми и строковыми',
	},
	{
		id: '8',
		name: 'Всё в одном',
		description: 'Как располагается в памяти данные из массив?',
		answer: 'Друг за другом',
	},
	{
		id: '9',
		name: 'Что-то непонятное',
		description: 'Как называется язык программирования, который исполняется напрямую процессором?',
		answer: 'Машинный код',
	},
	{
		id: '10',
		name: 'Он повсюду',
		description: 'Из какого материала химической таблицы производят процессоры?',
		answer: 'Si - кремний',
	},

];

export default questions;
